KASTORPROJECT/src/Catalogs/СопоставлениеСотрудниковИПользователей/СопоставлениеСотрудниковИПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СопоставлениеСотрудниковИПользователей</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/Catalogs/СопоставлениеСотрудниковИПользователей/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ТекущиеДанные = Объект; 
    
    Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
        
        НаименованиеСотрудника = ПолучитьНаименованиеСотрудника(Объект.Сотрудник);
        
        Если ЗначениеЗаполнено(НаименованиеСотрудника) Тогда
            Объект.Наименование = НаименованиеСотрудника;
        КонецЕсли;
        
    Иначе
        Объект.Наименование = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеСотрудника(СотрудникСсылка)
    
    Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
        Возврат "";
    КонецЕсли;
    
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникСсылка, "Наименование");
    
КонецФункции      


&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
    Элементы.ДатаОтмены.Видимость = Объект.Недействителен;
	
	Если Объект.Недействителен Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаОтмены) Тогда
			Объект.ДатаОтмены = ДатаСеанса(); 
		КонецЕсли;
	Иначе
		Объект.ДатаОтмены = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаКлиенте
Процедура НедействителенПриИзменении(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры
